Revit 2024 API
Dimension.ValueString Property
 The dimension value as a user visible string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string ValueString { get; }
Visual Basic
Public ReadOnly Property ValueString As String
	Get
Visual C++
public:
property String^ ValueString {
	String^ get ();
}
Remarks
 This property always return null if this is a spot dimension, or it is a linear dimension with more than one segments.
See Also
Dimension Class
Autodesk.Revit.DB Namespace